<template>
  <div style="margin:0 auto;">
    <div>
      <p style="text-align:center;padding:20px;">
        소중한 회원님의 정보는 동의 없이 공개 되지 않으며 개인정보보호 정책에
        의거하여 보호하고 있습니다.<br />
        (주)스윗미에서는 회원님들의 개인정보보호를 위해 최선을 다할 것을
        약속드립니다.<br /><br />
        <strong
          >이용약관, 개인정보수집 및 이용 안내에 대한 내용을 모두 확인하고
          동의합니다.</strong
        ><br />
      </p>
      <div class="agreeAll">
        <input
          type="checkbox"
          id="checkAll"
          name="checkAll"
          v-model="allAgree"
        />
        <label for="checkAll"> 모두 동의합니다</label>
      </div>
    </div>
    <hr style="width:70%;border:solid 1px #BDBDBD;margin:auto;" />
    <div class="contract1">
      <p>이용약관(필수)</p>
      <div class="agreeAll">
        <input type="checkbox" id="check1" name="check1" v-model="isAgree1" />
        <label for="check1"> 동의합니다</label>
      </div>
      <div class="contract2">
        제 1 장 총칙<br /><br />
        제 1 조 (목적)<br />
        이 약관은 주식회사 뮤엠교육(이하 “회사”)가 제공하는 교육콘텐츠 및 이에
        부수된 제반 서비스의 이용과 관련하여 회사와 회원 간의 권리, 의무 및
        책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.<br /><br />

        제 2 조 (용어의 정의)<br />
        1. 이 약관에서 사용하는 용어의 정의는 다음과 같습니다 “회사”라 함은
        온라인 또는 모바일 기기를 통하여 서비스를 제공하는 사업자를 의미합니다.
        “회원”이란 이 약관에 따라 이용계약을 체결하고, 회사가 제공하는 서비스를
        이용하는 자를 의미합니다. “교육서비스”라 함은 회사가 회원에게 제공하는
        교육콘텐츠 및 이에 부수된 제반 서비스를 의미합니다. “모바일 기기”란
        콘텐츠를 다운로드 받거나 설치하여 사용할 수 있는기기로서, 휴대폰,
        스마트폰, 휴대정보단말기(PDA), 태블릿 등을 의미합니다. “모바일
        교육서비스”란 회사가 회원에게 모바일 기기를 통하여 제공하는 교육콘텐츠
        및 이에 부수된 제반서비스를 의미합니다. “콘텐츠”란 회사가 교육서비스
        제공과 관련하여 디지털 방식으로 제작한 유료 또는 무료의 내용물일체
        (교육콘텐츠 및 네트워크 서비스, 애플리케이션 등)를 의미합니다.
        “계정(ID)”이라 함은 회원의 식별과 교육서비스 이용을 위하여 회원이
        선정하고 회사가 부여하는 문자, 숫자 또는 특수문자의 조합을 의미합니다.
        “계정정보”란 회원의 계정, 비밀번호, 성명 등 회원이 회사에 제공한
        일반정보, 기기정보, 이용요금 결제 정보 등을 통칭합니다. “캐릭터”라 함은
        회원이 교육서비스의 이용을 위하여 교육콘텐츠 내에서 회사가 제공하는
        방식에 따라 선정하고 조종하는 데이터를 의미합니다. “비밀번호”라 함은
        회원이 부여받은 계정과 일치되는 회원임을 확인하고 회원의 정보 및
        권익보호를 위해 회원 자신이 선정하여 비밀로 관리하는 문자, 숫자 또는
        특수문자의 조합을 의미합니다. “게시물”이라 함은 회원이 서비스를 이용함에
        있어 회원이 게시한 문자, 문서, 그림, 음성, 영상 또는 이들의 조합으로
        이루어진 모든 정보를 말합니다. "캔디톡"이라 함은 교육서비스를 이용 또는
        구매하기 위해 사용되는 가상의 결제수단을 의미합니다. "충전"이라 함은
        회원이 회사에 대금을 지급하고 캔디톡을 구입하는 것을 의미합니다.<br /><br />

        제 3 조 (회사정보 등의 제공)<br />
        회사는 다음 각 호의 사항을 회원이 알아보기 쉽도록 교육서비스 내에
        표시합니다. 다만, 개인정보처리방침과 약관은 회원이 연결화면을 통하여 볼
        수 있도록 할 수 있습니다<br /><br />

        상호 및 대표자의 성명<br />
        영업소 소재지 주소(회원의 불만을 처리할 수 있는 곳의 주소를 포함한다)<br />
        전화번호, 전자우편주소<br />
        사업자 등록번호<br />
        통신판매업 신고번호<br />
        개인정보처리방침<br />
        서비스 이용약관<br /><br />
        제 4 조 (약관의 효력 및 변경)<br />
        1. 회사는 이 약관의 내용을 회원이 알 수 있도록 교육서비스 내 또는 그
        연결화면, 서비스 홈페이지(www.mugobox.com)에 게시합니다. 2. 회사는
        회원이 회사와 이 약관의 내용에 관하여 질의 및 응답을 할 수 있도록 조치를
        취합니다. 3. 회사는 교육서비스를 이용하고자 하는 자(이하 “이용자”라
        한다)가 약관의 내용을 쉽게 알 수 있도록 작성하고 약관에 동의하기에 앞서
        약관에 정하여져 있는 내용 중 청약철회, 과오납금의 환급, 계약 해제ㆍ해지,
        회사의 면책사항 및 회원에 대한 피해보상 등과 같은 중요한 내용을 회원이
        쉽게 이해할 수 있도록 굵은 글씨 등으로 처리하거나 별도의 연결화면 또는
        팝업화면 등을 제공하고 이용자의 동의를얻도록 합니다. 4. 회사는
        「전자상거래 등에서의 소비자보호에 관한 법률」, 「약관의 규제에 관한
        법률」, 「게임산업진흥에 관한 법률」, 「정보통신망 이용촉진 및 정보보호
        등에 관한 법률」, 「콘텐츠산업 진흥법」 등 관련 법령에 위배하지 않는
        범위에서 이 약관을 개정할 수 있습니다. 5. 회사가 약관을 개정할 경우에는
        적용일자 및 개정내용, 개정사유 등을 명시하여 최소한 그 적용일 7 일
        이전부터 교육서비스 내 또는 그 연결화면에 게시하여 회원에게 공지합니다.
        다만, 변경된 내용이 회원에게 불리하거나 중대한 사항의 변경인 경우에는 그
        적용일 30 일 이전까지 본문과 같은 방법으로 공지하고 제 34 조 제 1 항의
        방법으로 회원에게 통지합니다. 이 경우 개정 전 내용과 개정 후 내용을
        명확하게 비교하여 회원이 알기 쉽도록 표시합니다. 6. 회사가 약관을 개정할
        경우 개정약관 공지 후 개정약관의 적용에 대한 회원의 동의 여부를
        확인합니다. 회사는 제 2 항의 공지 또는 통지를 할 경우 회원이 개정약관에
        대해 동의 또는 거부의 의사표시를 하지 않으면 동의한 것으로 볼 수 있다는
        내용도 함께 공지 또는 통지를 하며, 회원이 이 약관 시행일까지 거부의
        의사표시를 하지 않는다면 개정약관에 동의한 것으로 볼 수 있습니다. 7.
        회원이 개정약관의 적용에 동의하지 않는 경우 회사 또는 회원은 교육서비스
        이용계약을 해지할 수 있습니다. 제 5 조 (약관 외 준칙) 이 약관에서 정하지
        아니한 사항과 이 약관의 해석에 관하여는 「전자상거래 등에서의
        소비자보호에 관한 법률」,「약관의 규제에 관한 법률」, 「게임산업진흥에
        관한 법률」,「정보통신망이용촉진 및 정보보호 등에 관한
        법률」,「콘텐츠산업진흥법」 등 관련 법령 또는 상 관례에 따릅니다.
      </div>
      <p><br />개인정보수집및이용(필수)</p>
      <div class="agreeAll">
        <input type="checkbox" id="check2" name="check2" v-model="isAgree2" />
        <label for="check2"> 동의합니다</label>
      </div>
      <div class="contract2">
        ‘주식회사 스윗미'는 (이하 '회사'라 합니다.) 고객님의 개인정보를
        중요시하며, ‘정보통신망 이용촉진 및 정보보호 등에 관한 법률’ 및
        ‘개인정보보호법’ 등 회사가 준수하여야 할 관련 법령상의 개인정보보호
        규정을 준수하고 있습니다. 회사는 개인정보처리방침을 통하여 고객님께서
        제공하시는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며,
        개인정보보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다.
        <br /><br />
        회사는 개인정보처리방침을 개정하는 경우 웹사이트 공지사항(또는
        개별공지)을 통하여 공지할 것입니다<br />
        1. 수집하는 개인정보의 항목 및 수집방법<br />
        (1) 수집하는 개인정보의 항목<br />
        회원 가입 시 아래와 같은 정보가 수집됩니다<br />
        웹사이트 이용 시: 이메일 주소(계정명), 닉네임, 비밀번호<br />
        서비스 이용과정에서 아래와 같은 정보들이 수집될 수 있습니다<br />
        서비스 이용기록, 접속 로그, IP 정보, 불량 이용기록, 모바일 기기정보
        (모델명, 이동통신사 정보, OS 정보, 언어 및 국가정보, 기기 고유 식별번호,
        광고 ID 등)<br />
        연령 확인 및 본인인증이 필요한 서비스 제공 시 아래와 같은 정보가 수집될
        수 있습니다.<br />
        휴대폰 본인 인증자: 이름, 생년월일, 성별, 중복가입확인정보(DI),
        연계정보(CI), 내·외국인정보<br />
        만 14 세 미만 아동과 만 18 세 미만 청소년 이용자<br /><br />
        1. 법정대리인 본인인증 정보<br />
        - 법정대리인 이메일, 이름, 생년월일, 성별, 중복가입확인정보(DI),
        연계정보(CI)<br />
        <br /><br />
        회사는 아래의 고객관련 서비스 이용 시 부가적인 정보를 수집할 수 있으며,
        이 경우 별도의 개인정보 수집 및 이용 동의를 받습니다.
      </div>
    </div>
    <div style="text-align:center;">
      <div class="oneBtn" @click="$router.push('/')">
        <app-btn-middle
          :btnColor="'#FAFAFA'"
          :btnName="'취소'"
          :btnNameColor="'#424242'"
        ></app-btn-middle>
      </div>
      <div class="oneBtn" @click="goRouting">
        <app-btn-middle
          :isDisabled="!allAgree"
          :btnColor="'#424242'"
          :btnName="'다음'"
          :btnNameColor="'white'"
        ></app-btn-middle>
      </div>
    </div>
  </div>
</template>

<script>
import './user.css';
import AppBtnMiddle from '@/components/common/AppBtnMiddle.vue';

export default {
  components: {
    'app-btn-middle': AppBtnMiddle,
  },
  data: function() {
    return {
      isAgree1: false,
      isAgree2: false,
    };
  },
  created: function() {
    this.$emit('move-step', 1);
  },
  computed: {
    allAgree: {
      // getter
      get: function() {
        return this.isAgree1 && this.isAgree2;
      },
      // setter
      set: function(value) {
        if (value) {
          this.isAgree1 = true;
          this.isAgree2 = true;
        } else {
          this.isAgree1 = false;
          this.isAgree2 = false;
        }
      },
    },
  },
  methods: {
    goRouting: function() {
      if (this.allAgree) {
        this.$router.push('/join/join-auth');
      }
    },
  },
};
</script>

<style></style>
